[
    {
        "id": "rfr_prosecutor",
        "name": "Request for Recommendation",
        "enabled": true,
        "subject": "Request for Recommendation - {case_first_name} {case_middle_name} {case_last_name} - {case_case_id}",
        "category": "prosecutor",
        "creator": "Shawn",
        "type": "email",
        "text": "Dear {participant_name},\n\nI hope this email finds you well!\n\nI am reaching out on behalf of my client, {case_first_name} {case_middle_name} {case_last_name}, who has sought my representation in a criminal matter presently overseen by your office. The details pertaining to the case are as follows:\n\n- Case #: {case_case_id}\n- Charge: {case_charges_description}\n\nIn line with pursuing a resolution that upholds the principles of justice and fairness, I am reaching out to kindly request your recommendation regarding this matter. I have attached a copy of the citation(s) for your reference.\n\nShould you require any further information or documentation to facilitate your recommendation, please do not hesitate to let me know. I am eager to provide any assistance necessary to expedite this process.\n\nThank you for your attention to this matter. I look forward to hearing from you soon.\n\nBest regards,\n\n{signature}",
        "state": "MO",
        "user": "Shawn"
    },
    {
        "id": "drae_prosecutor",
        "name": "Driving Record Attached",
        "enabled": true,
        "subject": "Driving Record Attached Email - {case_first_name} {case_middle_name} {case_last_name} - {case_case_id}",
        "category": "prosecutor",
        "creator": "Shawn",
        "type": "email",
        "text": "Dear {participant_name},\n\nI trust you are doing well.\n\nPer your request, I have attached my client's driving record to this correspondence. Kindly confirm receipt at your earliest convenience and let me know if there is any additional information you require.\n\nFurthermore, I am eager to hear your thoughts on a potential recommendation regarding this matter. Establishing a timeline will greatly assist me in determining whether to request a continuance to afford you adequate time for review.\n\nI appreciate your attention to this matter and look forward to hearing from you soon.\n\nThank you,\n\n{signature}",
        "state": "MO",
        "user": "Shawn"
    },
    {
        "id": "ar_prosecutor",
        "name": "Acceptance of Recommendation",
        "enabled": true,
        "subject": "Acceptance of Recommendation - {case_first_name} {case_middle_name} {case_last_name} - {case_case_id}",
        "category": "prosecutor",
        "creator": "Shawn",
        "type": "email",
        "text": "Dear {participant_name},\n\nThank you for offer. We are appreciative of this and wish to proceed with accepting it.\n\nTo facilitate a smooth and prompt resolution, we would like to understand the exact steps to accept this offer formally. Could you please clarify the following:\n\n1. Could you confirm if the total amount inclusive of the fine and all court costs?\n2. What is the preferred method for submitting payment to the court? Are there any specific instructions we need to follow while sending the payment?\n3. Is there any formal documentation or forms we need to complete to formalize the acceptance of this offer?\n\nWe eagerly await your guidance on these queries to proceed accordingly.\n\nThank you for your assistance in this matter.\n\nBest regards,\n\n{signature}",
        "state": "MO",
        "user": "Shawn"
    },
    {
        "id": "eoa_customer",
        "name": "Filed Entry of Appearance",
        "trigger": "Entry of Appearance",
        "enabled": true,
        "category": "client",
        "creator": "Shawn",
        "type": "email",
        "subject": "Case Update: Ticket No. {case_case_id} - {case_charges_description} - {case_court_name}",
        "text": "Hey {case_first_name},\n\n**Here is an update on your case!**\n\n1. We filed our entry of appearance and are negotiating with the prosecutor to amend your ticket.\n2. Your court date is currently scheduled for {case_court_date} **@ (case_court_time}**.\n\nAt this time, your attendance in court is **NOT** required. We will let you know if this changes and keep you informed on any progress we make in our negotiations with the prosecutor.\n\nAs always, free to reach out with any questions or concerns.\n\nHave a great remainder of your day! 😎",
        "state": "MO",
        "user": "Shawn",
        "sms_message": "Hello! We filed our Entry of Appearance and are negotiating with the Prosecutor to amend your ticket. You can check your client portal for details, and we’ll make sure to keep you updated on any progress we make in our negotiations. Stay tuned! Ticket Takedown Team"
    },
    {
        "id": "filed_motion_customer",
        "name": "Filed Motion to Set Aside Guilty Plea",
        "enabled": true,
        "category": "client",
        "creator": "Shawn",
        "type": "email",
        "subject": "Case Update: Ticket No. {case_case_id} - {case_charges_description} - {case_court_name}",
        "text": "Dear {case_first_name},\n\nI trust you are doing well. I am reaching out to update you on the recent advancements in your case.\n\nWe have successfully filed an \"**Entry of Appearance**\"  and “**Motion to Set Aside”** the guilty plea on your behalf with the {case_court_name}. This crucial step officially notifies the court and all other parties involved that we are your legal representatives in this matter. Rest assured, we are now fully engaged in defending your interests in this case.\n\n**Current Court Date:** As it stands, a court date has not been scheduled. It is important to note that in order for the court to accept our Motion to Set Aside the guilty plea we will likely need to appear, however you will **NOT** need to appear**.** We will keep you updated on any alterations to this schedule, and we will inform you if your presence is required.\n\n**Next Steps:** Our immediate focus is to strategize your defense robustly. We aim to present a compelling argument to the prosecution to advocate for a reduction in your ticket charge.\n\n**Your Action Items:** At this juncture, no action is required from your end. However, we encourage you to reach out freely if you have any questions or if there are details you would like to discuss.\n\nThank you for entrusting us with your case. We are committed to working diligently on your behalf. Wishing you a pleasant day ahead!\n\nBest regards,",
        "state": "MO",
        "user": "Shawn"
    },
    {
        "id": "set_aside_customer",
        "name": "Set Aside Accepted",
        "enabled": true,
        "category": "client",
        "creator": "Shawn",
        "type": "email",
        "subject": "",
        "text": "Hey {case_first_name},\n\nGreat news! We have achieved a promising preliminary agreement with the prosecutor. Here is a summary of the progress:\n\n**Ticket No:** {case_case_id} - {case_charges_description}\n\nFollowing our petition, the judge permitted the withdrawal of your previous guilty plea. Consequently, the prosecutor is inclined to modify the charge to \"defective equipment,\" which is a non-moving violation. The new resolution comes with a total financial commitment of ${Total_Fees} inclusive of fines, court fees, and a processing charge.\n\nHere is what this update means for you:\n\n- No addition of points to your license\n- Your insurance premiums remain unchanged\n- Absence of the speeding ticket in your driving history\n\nGiven that you have already settled a part of the charge amounting to ${previous_payment}, your outstanding balance stands at ${balance_due}.\n\n**Next Steps:**\n\n1. Review and consider the plea offer.\n2. Should you consent, we will formalize the plea with the court. Subsequently, we will send over an invoice to your email. Alternately, access the invoice directly through this **[link]({invoice_link})**.\n3. Upon payment of the invoice, we undertake to fulfill all necessary actions, inclusive of endorsing the offer and completing the court's payment, thus negating the requirement for your court appearance.\n\nShould you have any queries or concerns, we are here to assist you. Feel free to reach out.\n\nCheers!",
        "state": "MO",
        "user": "Shawn"
    },
    {
        "id": "need_driving_record_customer",
        "name": "Need Driving Record",
        "enabled": true,
        "category": "client",
        "creator": "Shawn",
        "type": "email",
        "subject": "Driving Record Needed for {case_case_id} - {case_charges_description} - {case_court_name}",
        "text": "Good Morning {case_first_name},\n\nI hope this message finds you well. I wanted to provide you with a substantial update regarding the developments in your case:\n\nWe have officially filed our entry of appearance in court, marking the initiation of the discovery process. Currently, we are in the midst of negotiations with the prosecutor to best represent your interests in this matter.\n\n**Updated Court Date:** Please note that your initial court date on 07/27 has been rescheduled. The new date is set for 08/24 at 9: 00 a.m. You are not required to attend the court session at this point; however, we will promptly inform you if there is any change in this status.\n\n**Urgent Action Required:**\nTo assist us in representing you most effectively, we request you to email us a copy of your driving record as soon as possible. You can obtain this document online through the following link: [Driving Record Request](link to the driving record request).\n\nWe value open communication, and we encourage you to reach out at any time if you have questions or concerns.\n\nThank you for your cooperation, and we look forward to hearing from you soon.\n\nBest regards,",
        "state": "MO",
        "user": "Shawn"
    },
    {
        "id": "motion_to_recall_warrant_customer",
        "name": "Motion to Recall Warrant",
        "enabled": true,
        "category": "client",
        "creator": "Shawn",
        "type": "email",
        "subject": "Motion to Recall Warrant - {case_first_name} {case_middle_name} {case_last_name} - {case_case_id}",
        "text": "Dear {case_first_name},\n\nI hope this message finds you well. I am reaching out to update you on a crucial development in your case.\n\nIn light of the recent warrant issued against you, we have taken immediate action by filing a motion to recall the warrant with the {case_court_name}. This is a pivotal step towards ensuring your legal protection and maintaining your freedom while we continue to work on your case.\n\n**Next Court Date:** The court has assigned a new date for us to present this motion. The scheduled date is {case_court_date} at {case_court_time}. At this juncture, your attendance is not required; our team will represent you fully and advocate for the warrant to be lifted. Rest assured, we will communicate any changes and if in the future your presence becomes necessary.\n\n**Next Steps:** Parallelly, we are strengthening your defense strategy, keeping a keen focus on advocating for a favorable resolution to the charges levied against you.\n\n**Your Action Items:** At this time, no immediate action is needed from you. However, we emphasize open communication; please feel free to reach out at any point with questions or concerns, or to discuss any details pertinent to your case.\n\nThank you for entrusting us with your defense. We are committed to working tirelessly on your behalf to navigate these complex legal matters and aim to secure a positive outcome for you.\n\nWishing you strength and peace during this time.\n\nBest regards,",
        "state": "MO",
        "user": "Shawn"
    },
    {
        "id": "warrant_recalled_customer",
        "name": "Warrant Recalled",
        "enabled": true,
        "category": "client",
        "creator": "Shawn",
        "type": "email",
        "subject": "Warrant Recalled - {case_first_name} {case_middle_name} {case_last_name} - {case_case_id}",
        "text": "Dear {case_first_name},\n\nI trust this message finds you in a moment of relief and peace. I am writing with very good news regarding your case.\n\nI am pleased to inform you that the warrant previously issued against you has been successfully recalled. Our immediate action to file a motion to recall the warrant with the {case_court_name} has borne fruit, thereby ensuring your legal protection and safeguarding your freedom as we forge ahead in representing you in this matter.\n\n**Next Court Date:** Despite the recall of the warrant, there is a new court date set to {case_court_date} at {case_court_time} where we will continue to work towards a favorable outcome for you. It is not required for you to attend this court date, but rest assured, we will keep you abreast of all developments and notify you if your presence becomes necessary at any point.\n\n**Next Steps:** Our focus remains steadfast on building a strong defense strategy, aiming to secure a reduction or possible dismissal of the charges levied against you.\n\n**Your Action Items:** We invite you to breathe a little easier knowing this recent development, yet we remain at your disposal for any questions or concerns you may have. Please feel free to reach out at any moment should you wish to discuss any details concerning your case.\n\nThank you for placing your trust in our team. We are devoted to working diligently on your behalf, navigating these complex legal channels to secure the best possible outcome for you.\n\nSending you thoughts of strength and serenity in this period.\n\nBest regards,",
        "state": "MO",
        "user": "Shawn"
    },
    {
        "id": "submitted_rfr_customer",
        "name": "Submitted Request for Recommendation (Argument for Reduction)",
        "enabled": true,
        "category": "client",
        "creator": "Shawn",
        "type": "email",
        "subject": "Case Update: Ticket No. {case_case_id} - {case_charges_description} - {case_court_name}",
        "text": "**Dear {case_first_name},**\n\nI trust you are in good spirits. I am reaching out to share the latest developments in your case.\n\nWe have taken a significant step forward by presenting a compelling argument to the prosecution, advocating for a reduction in your ticket charge. We are now in the phase of awaiting the prosecutor's recommendation, which is a pivotal point in your case.\n\nTo give you a better understanding, a prosecutor's recommendation is a proposal on how your traffic ticket case might be resolved, taking into consideration various factors including the specifics of the incident and your driving history. This recommendation is a crucial element in determining the potential outcomes of your case.\n\n**Estimated Time for Recommendation:**\nWhile we anticipate receiving the recommendation within a week, please note that it can sometimes take up to three weeks, especially during busy periods.\n\n**Current Court Date:**\nYour court date is currently scheduled for {case_court_date} at {case_court_time}. It is important to note that this date may change, and as of now, your presence is not required. Rest assured, we will keep you informed of any changes.\n\n**Next Steps:**\nAt this stage, no action is required from you. We will continue to monitor the situation closely and will update you with any significant developments. We encourage you to reach out at any time if you have questions or need clarification on any aspect of your case.\n\nThank you for placing your trust in us. We are dedicated to representing your best interests diligently and effectively. Wishing you a peaceful and pleasant day ahead.\n\nBest regards,",
        "state": "MO",
        "user": "Shawn"
    },
    {
        "id": "filed_motion_for_continuance_customer",
        "name": "Filed Motion for Continuance",
        "enabled": true,
        "category": "client",
        "creator": "Shawn",
        "type": "email",
        "subject": "Case Update: Ticket No. {case_case_id} - {case_charges_description} - {case_court_name}",
        "text": "Dear {case_first_name},\n\nI trust you are in good spirits. I am writing to provide you with the latest developments in your ongoing case.\n\nRecently, we filed for a continuance with the {case_court_name} to allow us more time to build a strong defense strategy on your behalf. This step is quite significant as it gives us the opportunity to comprehensively approach your defense, ensuring that every viable avenue is explored and utilized to secure the best outcome for you.\n\n**Current Court Date:** The scheduled court date is currently set for {case_court_date} at {case_court_time}. However, due to the filed continuance, this date is subject to change. As soon as the court stipulates a new date and time, we will communicate this to you promptly. Please rest assured that we will continue to represent you fully in all required court sessions, alleviating the need for you to attend unless explicitly required. We will, of course, keep you abreast of any developments in this regard.\n\n**Next Steps:** Our focal point now is to rigorously strategize on your defense. Our goal remains to advocate firmly on your behalf, working towards achieving a favorable resolution, which may include a reduction in your ticket charge.\n\n**Your Action Items:** Currently, no action is required from you. However, we encourage open communication; feel free to reach out with any questions, concerns, or information that you may feel pertinent to the case. We are here to support you every step of the way.\n\nThank you for your trust in our services. We are steadfast in our commitment to working diligently on your behalf, championing your interests through each phase of this legal process. Wishing you a tranquil and positive day ahead.\n\nBest regards,",
        "state": "MO",
        "user": "Shawn",
        "sms_message": "Hello! We filed a continuance on your upcoming court date. Please check your client portal for details. Ticket Takedown Team"
    },
    {
        "id": "new_court_date_assigned_customer",
        "name": "New Court Date Assigned",
        "enabled": true,
        "category": "client",
        "creator": "Shawn",
        "type": "email",
        "subject": "New Court Date: Ticket No. {case_case_id} - {case_charges_description} - {case_court_name}",
        "text": "Dear {case_first_name},\n\nI trust you are in good spirits. I am reaching out to bring you up to date on the recent progress in your case.\n\nI wanted to inform you that the court has assigned a new date for your hearing. The details are as follows:\n\n**New Court Date:** {case_court_date} at {case_court_time}. It is important to note that, as of now, your presence is not required at this hearing; we will represent you fully. Rest assured, we will promptly notify you if there is any change to this or if your attendance becomes necessary in the future.\n\n**Next Steps:** With the new court date in place, our immediate focus is to robustly strategize your defense. We remain committed to advocating for a reduction in your ticket charge, leveraging every viable argument to your advantage.\n\n**Your Action Items:** At this stage, no immediate action is required from you. Nonetheless, we value open communication and encourage you to reach out at any time with questions or to discuss any details you believe may be beneficial to your case.\n\nThank you for placing your trust in our firm. We are diligently working to protect your interests and secure the most favorable outcome possible. Wishing you a peaceful day ahead.\n\nBest regards,",
        "state": "MO",
        "user": "Shawn",
        "sms_message": "Hello! The court issued a new date on your case. The event details were updated on your portal to reflect this change. Please check your client portal for details. Ticket Takedown Team"
    },
    {
        "id": "received_offer_to_amend_nmv_customer",
        "name": "Received Offer to Plea to Amend (Non Moving Violation)",
        "enabled": true,
        "category": "client",
        "creator": "Shawn",
        "type": "email",
        "subject": "Exciting Update on Your Case: Ticket No. {case_case_id} - {case_charges_description}",
        "text": "Hey {case_first_name},\n\nExciting news! We have been working diligently on your case and have secured a favorable plea offer through negotiations with the prosecutor. Below are the specific details:\n\n**Ticket No:** {case_case_id} - {case_charges_description}\n\nWe are pleased to share that the prosecutor has agreed to amend your ticket to a lesser charge of \"defective equipment,\" which is categorized as a non-moving violation. The total settlement amount for this adjustment is {total_amount} inclusive of fine, court costs, and processing fee.\n\nThis development implies that:\n\n- No points will be added to your license\n- Your insurance premiums will remain unaffected\n- The offense will not appear on your public driving record\n\n**Next Steps:**\n\nIf you agree with this offer, we will proceed to formalize it by presenting it to the court. Post your agreement, an invoice for the stipulated amount will be sent to your email. You may also access the invoice directly through this link: {invoice_link}\n\nUpon receiving your payment, we will manage all the necessary formalities on your behalf — this encompasses accepting the offer and settling the payment with the court. Consequently, there is no requirement for you to attend the court session scheduled on {case_court_date} at {case_court_time}.\n\n**To ensure a seamless process, kindly settle the invoice at least one week prior to the court date.**\n\nShould you have any questions or need further clarification, do not hesitate to reach out.\n\nLooking forward to hearing from you soon.\n\nCheers!",
        "state": "MO",
        "user": "Shawn",
        "sms_message": "Hello! Great news - we've received an offer from the prosecutor to amend your ticket! Please check your client portal for details of the offer and next steps. Ticket Takedown Team"
    },
    {
        "id": "received_offer_to_amend_no_point_customer",
        "name": "Received Offer to Amend  (No-Point) ",
        "enabled": true,
        "category": "client",
        "creator": "Shawn",
        "type": "email",
        "subject": "Good News on Your Case - Ticket No. {case_case_id}",
        "text": "Hey {case_first_name},\n\nGreat news! Our team has been working diligently on your behalf and we've negotiated a favorable plea offer with the prosecutor. Here are the updated details:\n\n**Ticket No:** {case_case_id} - Speeding{case_initial_speed_range}\n\nThe prosecutor has agreed to amend the ticket to a {case_amended_speed_range}, a no-point infraction. This comes with a total cost of {total_amount} which covers the fine, court costs, and processing fee. This amendment means that:\n\n- You will not incur any points on your license\n- You will be spared a significant increase in your insurance rate\n\n**Next Steps:**\n\nShould you accept this offer, we will move forward by presenting the agreement to the court. Subsequently, an email invoice for the agreed amount will be sent to you. You can access and settle the invoice through this link: {invoice_link}\n\nUpon receipt of your payment, we will represent you in accepting the offer and facilitating the payment to the court, alleviating the need for your court appearance.\n\n**Your scheduled court date is {case_court_date} at {case_court_time}. Please note, your presence is not required.**\n\nTo facilitate a smooth process, kindly adhere to the above steps at least one week prior to the scheduled court date.\n\nIf you have any questions or concerns, we are here to assist you. Feel free to reach out at any time.\n\nCheers!",
        "state": "MO",
        "user": "Shawn",
        "sms_message": "Hello! Great news - we've received an offer from the prosecutor to amend your ticket! Please check your client portal for details of the offer and next steps. Ticket Takedown Team"
    },
    {
        "id": "received_offer_for_dpa_customer",
        "name": "Received Offer for DPA",
        "enabled": true,
        "category": "client",
        "creator": "Shawn",
        "type": "email",
        "subject": "Good News on Your Case - Ticket No. {case_case_id}",
        "text": "Hey {case_first_name},\n\nGreat news! We have made substantial progress in your case and have successfully negotiated a favorable plea offer with the prosecutor. Here are the details:\n\n**Ticket No:** {case_case_id} - Speeding{case_initial_speed_range}\n\nThe prosecutor has agreed to offer a Deferred Prosecution Agreement (DPA). Essentially, a DPA equates to a \"delayed\" dismissal of your ticket. Should you remain free of any other traffic offenses for a span of 1 year, this ticket will be dismissed, thereby ensuring:\n\n- No points added to your license\n- No increase in your insurance rates\n- The absence of this speeding ticket on your driving record\n\nDo note that in case of any other speeding tickets issued to you during this 1-year period, both the ticket and accompanying points would reflect on your driving record.\n\nTo accept this DPA, a court fee amounting to {case_court_fee} is applicable.\n\n**Next Steps:**\n\nIf you are agreeable to this offer, we will facilitate its submission to the court. Following this, an invoice outlining the due amount will be sent to your email. Alternatively, access the invoice immediately using this link: {invoice_link}\n\nUpon receiving your payment, we will undertake all necessary actions on your behalf — encompassing the acceptance of the offer and court payment, negating the need for your court appearance.\n\n**Please note that your court date is scheduled for {case_court_date} at {case_court_time}. However, your appearance is not required.**\n\nTo ensure a seamless process, we encourage you to settle the invoice at least a week before the court date.\n\nFeel free to reach out should you have any questions or concerns. We are here to assist you.\n\nCheers!",
        "state": "MO",
        "user": "Shawn",
        "sms_message": "Hello! Great news - we've negotiated an offer from the prosecutor on your case! Please check your client portal for details of the offer and next steps. Ticket Takedown Team"
    },
    {
        "id": "refuse_to_amend_customer",
        "name": "Refuse to Amend (Refund)",
        "enabled": true,
        "category": "client",
        "creator": "Shawn",
        "type": "email",
        "subject": "Update on Your Case - Ticket No. {case_case_id}",
        "text": "Hey {case_first_name},\n\nRegrettably, following our discussion with the Prosecutor, we find ourselves unable to facilitate any amendments to your case at this moment. It appears that in {case_county_name} County, a recent policy has been enacted which prohibits the modification of citations relating to speeds exceeding 20+ mph over the specified limit.\n\nHere are the details pertaining to your upcoming court appointment:\n\nCourt Date: {case_court_date} @ {case_court_time}\nDue to the court's stringent policy, your presence is mandated at this hearing.\n\nGiven the circumstances and adhering to our commitment to serving your best interests, we have initiated a process to refund the full amount you paid. The refund should materialize in your account within a span of 5-10 business days.\n\nWe deeply regret the inconvenience this situation has precipitated. We stand available to answer any questions or address concerns you may have regarding this matter.\n\nWishing you a splendid remainder of the week!",
        "state": "MO",
        "user": "Shawn",
        "sms_message": "Hello! Unfortunately after speaking with the Prosecutor, we were not able to negotiate an offer to amend this citation, we initiated a full refund. It should be reflected in your account within 5-10 business days"
    },
    {
        "id": "reminder_to_pay_invoice_customer",
        "name": "Reminder to Pay Invoice",
        "enabled": true,
        "category": "client",
        "creator": "Shawn",
        "type": "email",
        "subject": "Important Update on Your Case - Ticket No. {case_case_id}",
        "text": "Good Morning {case_first_name},\n\nWe have received an update regarding your case. The court has issued a date for your hearing:\n\n**Court Date:** {case_court_date} @ {case_court_time}\n\nYou do not need to attend this hearing, provided that you settle the invoice a minimum of one week prior to the court date. Please find the payment details in the invoice linked below. Failure to settle the invoice within this timeframe will necessitate your presence at the court hearing.\n\n**[Stripe Invoice Link]({invoice_link})**\n\nUpon receipt of your payment, our team will manage all necessary procedures, representing you in court and facilitating the payment to the court on your behalf.\n\nWe appreciate your cooperation and wish you a wonderful week!",
        "state": "MO",
        "user": "Shawn",
        "repeat": true,
        "sms_message": "Hello! Your court date is approaching, and your outstanding invoice for the fine and court costs on your ticket is awaiting payment. To wrap up your case smoothly, please settle your invoice at your earliest convenience. Ticket Takedown Team"
    },
    {
        "id": "critical_reminder_to_pay_invoice_customer",
        "name": "Critical Reminder to Pay Invoice",
        "enabled": true,
        "category": "client",
        "creator": "Shawn",
        "type": "email",
        "subject": "Critical Reminder - Ticket No. {case_case_id}",
        "text": "Good Morning {case_first_name},\n\nWe have a critical update regarding the ongoing procedures in your case. The court has scheduled a hearing as detailed below:\n\n**Court Date:** {case_court_date} @ {case_court_time}\n\nTo continue offering our representation, it is imperative that you settle the pending invoice at least one week prior to the mentioned court date. You can find the payment details in the linked invoice below:\n\n**[Stripe Invoice Link]({invoice_link})**\n\nIf the invoice is not settled within the stipulated period, we regret to inform you that we will have to withdraw from representing you in this case, necessitating your attendance at the court hearing. This action is a last resort, and we sincerely hope it will not come to this point.\n\nUpon receiving your payment within the set timeframe, we will carry on with representing you and managing all necessary proceedings on your behalf, including court representations and facilitating all requisite payments to the court.\n\nWe value your cooperation and are looking forward to successfully navigating through this together.\n\nThank you and wishing you a constructive week ahead!",
        "state": "MO",
        "user": "Shawn",
        "repeat": true
    }
]